---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPSection.Roughness
source: html/0759a36f-1346-c346-7c86-46c7066206da.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSection.Roughness Property

The roughness of the section.

## Syntax (C#)
```csharp
public double Roughness { get; }
```

## Remarks
In one section, all section members have same roughness.
 Default unit is Decimal feet.
 For Duct, unit type is UT_HVAC_Roughness.
 For Pipe, unit type is UT_Piping_Roughness